Revit 2027 API
RevisionNumberingSequence.HasValidRevisionSettingsForNumberType Method
 Checks whether the revision numbering sequence owns a valid revision settings for number type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidRevisionSettingsForNumberType()
Public Function HasValidRevisionSettingsForNumberType As Boolean
public:
bool HasValidRevisionSettingsForNumberType()
member HasValidRevisionSettingsForNumberType : unit -> bool
Return Value
Boolean
 True if the revision numbering sequence owns a valid revision settings for number type.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace